[
  "What has keys but can’t open locks?",
  "What has hands but can’t clap?",
  "What gets wetter the more it dries?",
  "What has an eye but cannot see?",
  "What can travel around the world while staying in one corner?",
  "What comes once in a minute, twice in a moment, but never in a thousand years?",
  "I’m tall when I’m young and short when I’m old. What am I?",
  "The more you take, the more you leave behind. What is it?",
  "What has a head and a tail but no body?",
  "What has many teeth but can’t bite?",
  "What runs but never walks, has a bed but never sleeps, and a mouth but never eats?",
  "What can you catch but not throw?",
  "What has one eye but can’t see?",
  "What is always coming but never arrives?",
  "What breaks but never falls, and what falls but never breaks?",
  "What goes up but never comes down?",
  "What has a neck but no head?",
  "What has words but never speaks?",
  "What has a ring but no finger?",
  "What can fill a room but takes up no space?",
  "What can you hold in your left hand but not in your right?",
  "What has legs but doesn’t walk?",
  "What has a thumb and four fingers but is not alive?",
  "What kind of band never plays music?",
  "What begins with T, ends with T, and has T in it?",
  "What has a bottom at the top?",
  "What has a face and two hands but no arms or legs?",
  "What has an endless supply of letters but starts empty?",
  "What is full of holes but still holds water?",
  "What can’t be used until it’s broken?",
  "What goes up when rain comes down?",
  "What has cities but no houses, forests but no trees, and rivers but no water?",
  "What is so fragile that saying its name breaks it?",
  "What can you see once in a year, twice in a week, and never in a day?",
  "What has four wheels and flies?",
  "What is yours but others use it more than you do?",
  "What has a heart that doesn’t beat?",
  "What has a spine but no bones?",
  "What has an ear but cannot hear?",
  "What has a bark but no bite?",
  "What has a tail but no body?",
  "What can’t talk but will reply when spoken to?",
  "What has a bed but never sleeps?",
  "What comes down but never goes up?",
  "What can run but never tires?",
  "What is found in the middle of nowhere?",
  "What gets bigger the more you take away?",
  "What has 13 hearts but no other organs?",
  "What has a head, a tail, is brown, and has no legs?",
  "What is easy to lift but hard to throw?",
  "What can you keep after giving to someone?",
  "What is black when it’s clean and white when it’s dirty?",
  "What has a tongue but cannot taste?",
  "What has a mouth but cannot speak?",
  "What has a lock but no key?",
  "What is always in front of you but can’t be seen?",
  "What can be cracked, made, told, and played?",
  "What can you make that no one—not even you—can see?",
  "What has a shadow but no body?",
  "What has a roof but no walls?",
  "What is made of water but if you put it in water it dies?",
  "What is taken before you can get it?",
  "What has two banks but no money?",
  "What has a foot but no legs?",
  "What has a needle but doesn’t sew?",
  "What has a palm but no fingers?",
  "What can be heard but not seen?",
  "What has a cape but isn’t a hero?",
  "What is as light as a feather, yet no one can hold it for long?",
  "What is thrown out when needed and taken in when not needed?",
  "What can you break without touching it?",
  "What has four fingers and a thumb but isn’t alive?",
  "What goes through cities and fields but never moves?",
  "What has a lot of eyes but can’t see?",
  "What has one head, one foot, and four legs?",
  "What has six faces but doesn’t wear makeup?",
  "What has a single voice but can sing in many tones?",
  "What has an end but no beginning?",
  "What has no life but can die?",
  "What has no weight but can be heavy?",
  "What has no wings but can fly?",
  "What comes after lightning but before thunder?",
  "What belongs to you but is used by others?",
  "What is the quietest thing in the world?",
  "What has one letter but two words?",
  "What is greater than God, more evil than the devil, the poor have it, the rich need it, and if you eat it you’ll die?",
  "What can be swallowed but can also swallow you?",
  "What has a head but no brain?",
  "What can be measured but not seen?",
  "What is cut on a table but is never eaten?",
  "What has keys but can’t type?",
  "What is bought to eat but never eaten?",
  "What gets sharper the more you use it?",
  "What has a tail that wags but isn’t a dog?",
  "Main bina bole bolta hoon, bina chaley chalata hoon. Main kaun hoon?",
  "Aisi kaunsi cheez hai jo tootne par hi kaam aati hai?",
  "Wo kya hai jo tum de sakte ho par rakh nahi sakte?",
  "Kaunsi cheez jitna bharo utni halki hoti jaati hai?",
  "Kaunsi cheez paani me daalne par bhi geeli nahi hoti?",
  "Ek aisi cheez jo din me hoti hai, raat me nahi. Kya?",
  "Main jitna bada hota hoon, utna chhota dikhai deta hoon. Main kaun?",
  "Mere paas taala hai par chaabi nahi. Main kaun?",
  "Main khud bol nahi sakta, par tum bolo to jawab deta hoon. Main kaun?",
  "Kya cheez hai jo chalti to hai par pair nahi hote?",
  "Kya cheez hai jo toot-ti nahi par tod deti hai?",
  "Kya cheez hai jo sabke paas hoti hai, par dikhti nahi?",
  "Kya cheez hai jo khud geeli nahi hoti par sabko sukha deti hai?",
  "Kya cheez hai jo jitna kaato utni badi hoti jaati hai?",
  "Kya cheez hai jo sabse zyada kaam ki hoti hai jab woh khaali ho?",
  "Kya cheez hai jo tumhare paas hai par log zyada use karte hain?",
  "Kya cheez hai jo bina aag ke jalti hai?",
  "Kya cheez hai jo jitni saaf utni kaali hoti hai?",
  "Kya cheez hai jo hawa me hoti hai par pakad nahi sakte?",
  "Kya cheez hai jo baarish me upar jaati hai?",
  "I’m red at night and invisible in daylight. What am I?",
  "I’m blue at night and invisible in daylight. What am I?",
  "I’m green at night and invisible in daylight. What am I?",
  "I’m yellow at night and invisible in daylight. What am I?",
  "I’m black at night and invisible in daylight. What am I?",
  "I’m white at night and invisible in daylight. What am I?",
  "I’m purple at night and invisible in daylight. What am I?",
  "I’m orange at night and invisible in daylight. What am I?",
  "I can be in a box but I’m not physical. The more you share me, the less you have. What am I?",
  "I can be in a room but I’m not physical. The more you share me, the less you have. What am I?",
  "I can be in a bottle but I’m not physical. The more you share me, the less you have. What am I?",
  "I can be in a bag but I’m not physical. The more you share me, the less you have. What am I?",
  "I can be in a house but I’m not physical. The more you share me, the less you have. What am I?",
  "I can be in a train but I’m not physical. The more you share me, the less you have. What am I?",
  "I can be in a road but I’m not physical. The more you share me, the less you have. What am I?",
  "I can be in a river but I’m not physical. The more you share me, the less you have. What am I?",
  "I can be in a clock but I’m not physical. The more you share me, the less you have. What am I?",
  "I can be in a mirror but I’m not physical. The more you share me, the less you have. What am I?",
  "I can be in a shadow but I’m not physical. The more you share me, the less you have. What am I?",
  "I can be in a map but I’m not physical. The more you share me, the less you have. What am I?",
  "I can be in a book but I’m not physical. The more you share me, the less you have. What am I?",
  "I can be in a key but I’m not physical. The more you share me, the less you have. What am I?",
  "I can be in a coin but I’m not physical. The more you share me, the less you have. What am I?",
  "I can be in a candle but I’m not physical. The more you share me, the less you have. What am I?",
  "I can be in a towel but I’m not physical. The more you share me, the less you have. What am I?",
  "I can be in a sponge but I’m not physical. The more you share me, the less you have. What am I?",
  "You can break me without touching me. What am I?",
  "You can hold me without touching me. What am I?",
  "You can carry me without touching me. What am I?",
  "You can see me without touching me. What am I?",
  "You can hear me without touching me. What am I?",
  "You can catch me without touching me. What am I?",
  "You can lose me without touching me. What am I?",
  "You can find me without touching me. What am I?",
  "You can take me without touching me. What am I?",
  "You can give me without touching me. What am I?",
  "I help you go up a staircase but I’m not a step. What am I?",
  "I help you go up a ladder but I’m not a step. What am I?",
  "I help you go up a hill but I’m not a step. What am I?",
  "I help you go up a mountain but I’m not a step. What am I?",
  "I have 1 letters in my name, but I’m not a word. What am I?",
  "I have 2 letters in my name, but I’m not a word. What am I?",
  "I have 3 letters in my name, but I’m not a word. What am I?",
  "I have 4 letters in my name, but I’m not a word. What am I?",
  "I have 5 letters in my name, but I’m not a word. What am I?",
  "I have 6 letters in my name, but I’m not a word. What am I?",
  "I have 7 letters in my name, but I’m not a word. What am I?",
  "I have 8 letters in my name, but I’m not a word. What am I?",
  "I have 9 letters in my name, but I’m not a word. What am I?",
  "I have 10 letters in my name, but I’m not a word. What am I?",
  "I have 11 letters in my name, but I’m not a word. What am I?",
  "I have 12 letters in my name, but I’m not a word. What am I?",
  "I have 13 letters in my name, but I’m not a word. What am I?",
  "I have 14 letters in my name, but I’m not a word. What am I?",
  "I have 15 letters in my name, but I’m not a word. What am I?",
  "I have 16 letters in my name, but I’m not a word. What am I?",
  "I have 17 letters in my name, but I’m not a word. What am I?",
  "I have 18 letters in my name, but I’m not a word. What am I?",
  "I have 19 letters in my name, but I’m not a word. What am I?",
  "I have 20 letters in my name, but I’m not a word. What am I?",
  "I have 21 letters in my name, but I’m not a word. What am I?",
  "I have 22 letters in my name, but I’m not a word. What am I?",
  "I have 23 letters in my name, but I’m not a word. What am I?",
  "I have 24 letters in my name, but I’m not a word. What am I?",
  "I have 25 letters in my name, but I’m not a word. What am I?",
  "I have 26 letters in my name, but I’m not a word. What am I?",
  "I have 27 letters in my name, but I’m not a word. What am I?",
  "I have 28 letters in my name, but I’m not a word. What am I?",
  "I have 29 letters in my name, but I’m not a word. What am I?",
  "I have 30 letters in my name, but I’m not a word. What am I?",
  "Which has keys but can’t open locks? (variant 185)",
  "Which has hands but can’t clap? (variant 186)",
  "Which gets wetter the more it dries? (variant 187)",
  "Which has an eye but cannot see? (variant 188)",
  "Which can travel around the world while staying in one corner? (variant 189)",
  "Which comes once in a minute, twice in a moment, but never in a thousand years? (variant 190)",
  "I’m tall when I’m young and short when I’m old. Which am I? (variant 191)",
  "The more you take, the more you leave behind. Which is it? (variant 192)",
  "Which has a head and a tail but no body? (variant 193)",
  "Which has many teeth but can’t bite? (variant 194)",
  "Which runs but never walks, has a bed but never sleeps, and a mouth but never eats? (variant 195)",
  "Which can you catch but not throw? (variant 196)",
  "Which has one eye but can’t see? (variant 197)",
  "Which is always coming but never arrives? (variant 198)",
  "Which breaks but never falls, and what falls but never breaks? (variant 199)",
  "Which goes up but never comes down? (variant 200)",
  "Which has a neck but no head? (variant 201)",
  "Which has words but never speaks? (variant 202)",
  "Which has a ring but no finger? (variant 203)",
  "Which can fill a room but takes up no space? (variant 204)",
  "Which can you hold in your left hand but not in your right? (variant 205)",
  "Which has legs but doesn’t walk? (variant 206)",
  "Which has a thumb and four fingers but is not alive? (variant 207)",
  "Which kind of band never plays music? (variant 208)",
  "Which begins with T, ends with T, and has T in it? (variant 209)",
  "Which has a bottom at the top? (variant 210)",
  "Which has a face and two hands but no arms or legs? (variant 211)",
  "Which has an endless supply of letters but starts empty? (variant 212)",
  "Which is full of holes but still holds water? (variant 213)",
  "Which can’t be used until it’s broken? (variant 214)",
  "Which goes up when rain comes down? (variant 215)",
  "Which has cities but no houses, forests but no trees, and rivers but no water? (variant 216)",
  "Which is so fragile that saying its name breaks it? (variant 217)",
  "Which can you see once in a year, twice in a week, and never in a day? (variant 218)",
  "Which has four wheels and flies? (variant 219)",
  "Which is yours but others use it more than you do? (variant 220)",
  "Which has a heart that doesn’t beat? (variant 221)",
  "Which has a spine but no bones? (variant 222)",
  "Which has an ear but cannot hear? (variant 223)",
  "Which has a bark but no bite? (variant 224)",
  "Which has a tail but no body? (variant 225)",
  "Which can’t talk but will reply when spoken to? (variant 226)",
  "Which has a bed but never sleeps? (variant 227)",
  "Which comes down but never goes up? (variant 228)",
  "Which can run but never tires? (variant 229)",
  "Which is found in the middle of nowhere? (variant 230)",
  "Which gets bigger the more you take away? (variant 231)",
  "Which has 13 hearts but no other organs? (variant 232)",
  "Which has a head, a tail, is brown, and has no legs? (variant 233)",
  "Which is easy to lift but hard to throw? (variant 234)",
  "Which can you keep after giving to someone? (variant 235)",
  "Which is black when it’s clean and white when it’s dirty? (variant 236)",
  "Which has a tongue but cannot taste? (variant 237)",
  "Which has a mouth but cannot speak? (variant 238)",
  "Which has a lock but no key? (variant 239)",
  "Which is always in front of you but can’t be seen? (variant 240)",
  "Which can be cracked, made, told, and played? (variant 241)",
  "Which can you make that no one—not even you—can see? (variant 242)",
  "Which has a shadow but no body? (variant 243)",
  "Which has a roof but no walls? (variant 244)",
  "Which is made of water but if you put it in water it dies? (variant 245)",
  "Which is taken before you can get it? (variant 246)",
  "Which has two banks but no money? (variant 247)",
  "Which has a foot but no legs? (variant 248)",
  "Which has a needle but doesn’t sew? (variant 249)",
  "Which has a palm but no fingers? (variant 250)",
  "Which can be heard but not seen? (variant 251)",
  "Which has a cape but isn’t a hero? (variant 252)",
  "Which is as light as a feather, yet no one can hold it for long? (variant 253)",
  "Which is thrown out when needed and taken in when not needed? (variant 254)",
  "Which can you break without touching it? (variant 255)",
  "Which has four fingers and a thumb but isn’t alive? (variant 256)",
  "Which goes through cities and fields but never moves? (variant 257)",
  "Which has a lot of eyes but can’t see? (variant 258)",
  "Which has one head, one foot, and four legs? (variant 259)",
  "Which has six faces but doesn’t wear makeup? (variant 260)",
  "Which has a single voice but can sing in many tones? (variant 261)",
  "Which has an end but no beginning? (variant 262)",
  "Which has no life but can die? (variant 263)",
  "Which has no weight but can be heavy? (variant 264)",
  "Which has no wings but can fly? (variant 265)",
  "Which comes after lightning but before thunder? (variant 266)",
  "Which belongs to you but is used by others? (variant 267)",
  "Which is the quietest thing in the world? (variant 268)",
  "Which has one letter but two words? (variant 269)",
  "Which is greater than God, more evil than the devil, the poor have it, the rich need it, and if you eat it you’ll die? (variant 270)",
  "Which can be swallowed but can also swallow you? (variant 271)",
  "Which has a head but no brain? (variant 272)",
  "Which can be measured but not seen? (variant 273)",
  "Which is cut on a table but is never eaten? (variant 274)",
  "Which has keys but can’t type? (variant 275)",
  "Which is bought to eat but never eaten? (variant 276)",
  "Which gets sharper the more you use it? (variant 277)",
  "Which has a tail that wags but isn’t a dog? (variant 278)",
  "Main bina bole bolta hoon, bina chaley chalata hoon. Main kaun hoon? (variant 279)",
  "Aisi kaunsi cheez hai jo tootne par hi kaam aati hai? (variant 280)",
  "Wo kya hai jo tum de sakte ho par rakh nahi sakte? (variant 281)",
  "Kaunsi cheez jitna bharo utni halki hoti jaati hai? (variant 282)",
  "Kaunsi cheez paani me daalne par bhi geeli nahi hoti? (variant 283)",
  "Ek aisi cheez jo din me hoti hai, raat me nahi. Kaunsi? (variant 284)",
  "Main jitna bada hota hoon, utna chhota dikhai deta hoon. Main kaun? (variant 285)",
  "Mere paas taala hai par chaabi nahi. Main kaun? (variant 286)",
  "Main khud bol nahi sakta, par tum bolo to jawab deta hoon. Main kaun? (variant 287)",
  "Kaunsi cheez hai jo chalti to hai par pair nahi hote? (variant 288)",
  "Kaunsi cheez hai jo toot-ti nahi par tod deti hai? (variant 289)",
  "Kaunsi cheez hai jo sabke paas hoti hai, par dikhti nahi? (variant 290)",
  "Kaunsi cheez hai jo khud geeli nahi hoti par sabko sukha deti hai? (variant 291)",
  "Kaunsi cheez hai jo jitna kaato utni badi hoti jaati hai? (variant 292)",
  "Kaunsi cheez hai jo sabse zyada kaam ki hoti hai jab woh khaali ho? (variant 293)",
  "Kaunsi cheez hai jo tumhare paas hai par log zyada use karte hain? (variant 294)",
  "Kaunsi cheez hai jo bina aag ke jalti hai? (variant 295)",
  "Kaunsi cheez hai jo jitni saaf utni kaali hoti hai? (variant 296)",
  "Kaunsi cheez hai jo hawa me hoti hai par pakad nahi sakte? (variant 297)",
  "Kaunsi cheez hai jo baarish me upar jaati hai? (variant 298)",
  "I’m red at night and invisible in daylight. Which am I? (variant 299)",
  "I’m blue at night and invisible in daylight. Which am I? (variant 300)",
  "I’m green at night and invisible in daylight. Which am I? (variant 301)",
  "I’m yellow at night and invisible in daylight. Which am I? (variant 302)",
  "I’m black at night and invisible in daylight. Which am I? (variant 303)",
  "I’m white at night and invisible in daylight. Which am I? (variant 304)",
  "I’m purple at night and invisible in daylight. Which am I? (variant 305)",
  "I’m orange at night and invisible in daylight. Which am I? (variant 306)",
  "I can be in a box but I’m not physical. The more you share me, the less you have. Which am I? (variant 307)",
  "I can be in a room but I’m not physical. The more you share me, the less you have. Which am I? (variant 308)",
  "I can be in a bottle but I’m not physical. The more you share me, the less you have. Which am I? (variant 309)",
  "I can be in a bag but I’m not physical. The more you share me, the less you have. Which am I? (variant 310)",
  "I can be in a house but I’m not physical. The more you share me, the less you have. Which am I? (variant 311)",
  "I can be in a train but I’m not physical. The more you share me, the less you have. Which am I? (variant 312)",
  "I can be in a road but I’m not physical. The more you share me, the less you have. Which am I? (variant 313)",
  "I can be in a river but I’m not physical. The more you share me, the less you have. Which am I? (variant 314)",
  "I can be in a clock but I’m not physical. The more you share me, the less you have. Which am I? (variant 315)",
  "I can be in a mirror but I’m not physical. The more you share me, the less you have. Which am I? (variant 316)",
  "I can be in a shadow but I’m not physical. The more you share me, the less you have. Which am I? (variant 317)",
  "I can be in a map but I’m not physical. The more you share me, the less you have. Which am I? (variant 318)",
  "I can be in a book but I’m not physical. The more you share me, the less you have. Which am I? (variant 319)",
  "I can be in a key but I’m not physical. The more you share me, the less you have. Which am I? (variant 320)",
  "I can be in a coin but I’m not physical. The more you share me, the less you have. Which am I? (variant 321)",
  "I can be in a candle but I’m not physical. The more you share me, the less you have. Which am I? (variant 322)",
  "I can be in a towel but I’m not physical. The more you share me, the less you have. Which am I? (variant 323)",
  "I can be in a sponge but I’m not physical. The more you share me, the less you have. Which am I? (variant 324)",
  "You can break me without touching me. Which am I? (variant 325)",
  "You can hold me without touching me. Which am I? (variant 326)",
  "You can carry me without touching me. Which am I? (variant 327)",
  "You can see me without touching me. Which am I? (variant 328)",
  "You can hear me without touching me. Which am I? (variant 329)",
  "You can catch me without touching me. Which am I? (variant 330)",
  "You can lose me without touching me. Which am I? (variant 331)",
  "You can find me without touching me. Which am I? (variant 332)",
  "You can take me without touching me. Which am I? (variant 333)",
  "You can give me without touching me. Which am I? (variant 334)",
  "I help you go up a staircase but I’m not a step. Which am I? (variant 335)",
  "I help you go up a ladder but I’m not a step. Which am I? (variant 336)",
  "I help you go up a hill but I’m not a step. Which am I? (variant 337)",
  "I help you go up a mountain but I’m not a step. Which am I? (variant 338)",
  "I have 1 letters in my name, but I’m not a word. Which am I? (variant 339)",
  "I have 2 letters in my name, but I’m not a word. Which am I? (variant 340)",
  "I have 3 letters in my name, but I’m not a word. Which am I? (variant 341)",
  "I have 4 letters in my name, but I’m not a word. Which am I? (variant 342)",
  "I have 5 letters in my name, but I’m not a word. Which am I? (variant 343)",
  "I have 6 letters in my name, but I’m not a word. Which am I? (variant 344)",
  "I have 7 letters in my name, but I’m not a word. Which am I? (variant 345)",
  "I have 8 letters in my name, but I’m not a word. Which am I? (variant 346)",
  "I have 9 letters in my name, but I’m not a word. Which am I? (variant 347)",
  "I have 10 letters in my name, but I’m not a word. Which am I? (variant 348)",
  "I have 11 letters in my name, but I’m not a word. Which am I? (variant 349)",
  "I have 12 letters in my name, but I’m not a word. Which am I? (variant 350)",
  "I have 13 letters in my name, but I’m not a word. Which am I? (variant 351)",
  "I have 14 letters in my name, but I’m not a word. Which am I? (variant 352)",
  "I have 15 letters in my name, but I’m not a word. Which am I? (variant 353)",
  "I have 16 letters in my name, but I’m not a word. Which am I? (variant 354)",
  "I have 17 letters in my name, but I’m not a word. Which am I? (variant 355)",
  "I have 18 letters in my name, but I’m not a word. Which am I? (variant 356)",
  "I have 19 letters in my name, but I’m not a word. Which am I? (variant 357)",
  "I have 20 letters in my name, but I’m not a word. Which am I? (variant 358)",
  "I have 21 letters in my name, but I’m not a word. Which am I? (variant 359)",
  "I have 22 letters in my name, but I’m not a word. Which am I? (variant 360)",
  "I have 23 letters in my name, but I’m not a word. Which am I? (variant 361)",
  "I have 24 letters in my name, but I’m not a word. Which am I? (variant 362)",
  "I have 25 letters in my name, but I’m not a word. Which am I? (variant 363)",
  "I have 26 letters in my name, but I’m not a word. Which am I? (variant 364)",
  "I have 27 letters in my name, but I’m not a word. Which am I? (variant 365)",
  "I have 28 letters in my name, but I’m not a word. Which am I? (variant 366)",
  "I have 29 letters in my name, but I’m not a word. Which am I? (variant 367)",
  "I have 30 letters in my name, but I’m not a word. Which am I? (variant 368)",
  "Which has keys but can’t open locks? (variant 369)",
  "Which has hands but can’t clap? (variant 370)",
  "Which gets wetter the more it dries? (variant 371)",
  "Which has an eye but cannot see? (variant 372)",
  "Which can travel around the world while staying in one corner? (variant 373)",
  "Which comes once in a minute, twice in a moment, but never in a thousand years? (variant 374)",
  "I’m tall when I’m young and short when I’m old. Which am I? (variant 375)",
  "The more you take, the more you leave behind. Which is it? (variant 376)",
  "Which has a head and a tail but no body? (variant 377)",
  "Which has many teeth but can’t bite? (variant 378)",
  "Which runs but never walks, has a bed but never sleeps, and a mouth but never eats? (variant 379)",
  "Which can you catch but not throw? (variant 380)",
  "Which has one eye but can’t see? (variant 381)",
  "Which is always coming but never arrives? (variant 382)",
  "Which breaks but never falls, and what falls but never breaks? (variant 383)",
  "Which goes up but never comes down? (variant 384)",
  "Which has a neck but no head? (variant 385)",
  "Which has words but never speaks? (variant 386)",
  "Which has a ring but no finger? (variant 387)",
  "Which can fill a room but takes up no space? (variant 388)",
  "Which can you hold in your left hand but not in your right? (variant 389)",
  "Which has legs but doesn’t walk? (variant 390)",
  "Which has a thumb and four fingers but is not alive? (variant 391)",
  "Which kind of band never plays music? (variant 392)",
  "Which begins with T, ends with T, and has T in it? (variant 393)",
  "Which has a bottom at the top? (variant 394)",
  "Which has a face and two hands but no arms or legs? (variant 395)",
  "Which has an endless supply of letters but starts empty? (variant 396)",
  "Which is full of holes but still holds water? (variant 397)",
  "Which can’t be used until it’s broken? (variant 398)",
  "Which goes up when rain comes down? (variant 399)",
  "Which has cities but no houses, forests but no trees, and rivers but no water? (variant 400)",
  "Which is so fragile that saying its name breaks it? (variant 401)",
  "Which can you see once in a year, twice in a week, and never in a day? (variant 402)",
  "Which has four wheels and flies? (variant 403)",
  "Which is yours but others use it more than you do? (variant 404)",
  "Which has a heart that doesn’t beat? (variant 405)",
  "Which has a spine but no bones? (variant 406)",
  "Which has an ear but cannot hear? (variant 407)",
  "Which has a bark but no bite? (variant 408)",
  "Which has a tail but no body? (variant 409)",
  "Which can’t talk but will reply when spoken to? (variant 410)",
  "Which has a bed but never sleeps? (variant 411)",
  "Which comes down but never goes up? (variant 412)",
  "Which can run but never tires? (variant 413)",
  "Which is found in the middle of nowhere? (variant 414)",
  "Which gets bigger the more you take away? (variant 415)",
  "Which has 13 hearts but no other organs? (variant 416)",
  "Which has a head, a tail, is brown, and has no legs? (variant 417)",
  "Which is easy to lift but hard to throw? (variant 418)",
  "Which can you keep after giving to someone? (variant 419)",
  "Which is black when it’s clean and white when it’s dirty? (variant 420)",
  "Which has a tongue but cannot taste? (variant 421)",
  "Which has a mouth but cannot speak? (variant 422)",
  "Which has a lock but no key? (variant 423)",
  "Which is always in front of you but can’t be seen? (variant 424)",
  "Which can be cracked, made, told, and played? (variant 425)",
  "Which can you make that no one—not even you—can see? (variant 426)",
  "Which has a shadow but no body? (variant 427)",
  "Which has a roof but no walls? (variant 428)",
  "Which is made of water but if you put it in water it dies? (variant 429)",
  "Which is taken before you can get it? (variant 430)",
  "Which has two banks but no money? (variant 431)",
  "Which has a foot but no legs? (variant 432)",
  "Which has a needle but doesn’t sew? (variant 433)",
  "Which has a palm but no fingers? (variant 434)",
  "Which can be heard but not seen? (variant 435)",
  "Which has a cape but isn’t a hero? (variant 436)",
  "Which is as light as a feather, yet no one can hold it for long? (variant 437)",
  "Which is thrown out when needed and taken in when not needed? (variant 438)",
  "Which can you break without touching it? (variant 439)",
  "Which has four fingers and a thumb but isn’t alive? (variant 440)",
  "Which goes through cities and fields but never moves? (variant 441)",
  "Which has a lot of eyes but can’t see? (variant 442)",
  "Which has one head, one foot, and four legs? (variant 443)",
  "Which has six faces but doesn’t wear makeup? (variant 444)",
  "Which has a single voice but can sing in many tones? (variant 445)",
  "Which has an end but no beginning? (variant 446)",
  "Which has no life but can die? (variant 447)",
  "Which has no weight but can be heavy? (variant 448)",
  "Which has no wings but can fly? (variant 449)",
  "Which comes after lightning but before thunder? (variant 450)",
  "Which belongs to you but is used by others? (variant 451)",
  "Which is the quietest thing in the world? (variant 452)",
  "Which has one letter but two words? (variant 453)",
  "Which is greater than God, more evil than the devil, the poor have it, the rich need it, and if you eat it you’ll die? (variant 454)",
  "Which can be swallowed but can also swallow you? (variant 455)",
  "Which has a head but no brain? (variant 456)",
  "Which can be measured but not seen? (variant 457)",
  "Which is cut on a table but is never eaten? (variant 458)",
  "Which has keys but can’t type? (variant 459)",
  "Which is bought to eat but never eaten? (variant 460)",
  "Which gets sharper the more you use it? (variant 461)",
  "Which has a tail that wags but isn’t a dog? (variant 462)",
  "Main bina bole bolta hoon, bina chaley chalata hoon. Main kaun hoon? (variant 463)",
  "Aisi kaunsi cheez hai jo tootne par hi kaam aati hai? (variant 464)",
  "Wo kya hai jo tum de sakte ho par rakh nahi sakte? (variant 465)",
  "Kaunsi cheez jitna bharo utni halki hoti jaati hai? (variant 466)",
  "Kaunsi cheez paani me daalne par bhi geeli nahi hoti? (variant 467)",
  "Ek aisi cheez jo din me hoti hai, raat me nahi. Kaunsi? (variant 468)",
  "Main jitna bada hota hoon, utna chhota dikhai deta hoon. Main kaun? (variant 469)",
  "Mere paas taala hai par chaabi nahi. Main kaun? (variant 470)",
  "Main khud bol nahi sakta, par tum bolo to jawab deta hoon. Main kaun? (variant 471)",
  "Kaunsi cheez hai jo chalti to hai par pair nahi hote? (variant 472)",
  "Kaunsi cheez hai jo toot-ti nahi par tod deti hai? (variant 473)",
  "Kaunsi cheez hai jo sabke paas hoti hai, par dikhti nahi? (variant 474)",
  "Kaunsi cheez hai jo khud geeli nahi hoti par sabko sukha deti hai? (variant 475)",
  "Kaunsi cheez hai jo jitna kaato utni badi hoti jaati hai? (variant 476)",
  "Kaunsi cheez hai jo sabse zyada kaam ki hoti hai jab woh khaali ho? (variant 477)",
  "Kaunsi cheez hai jo tumhare paas hai par log zyada use karte hain? (variant 478)",
  "Kaunsi cheez hai jo bina aag ke jalti hai? (variant 479)",
  "Kaunsi cheez hai jo jitni saaf utni kaali hoti hai? (variant 480)",
  "Kaunsi cheez hai jo hawa me hoti hai par pakad nahi sakte? (variant 481)",
  "Kaunsi cheez hai jo baarish me upar jaati hai? (variant 482)",
  "I’m red at night and invisible in daylight. Which am I? (variant 483)",
  "I’m blue at night and invisible in daylight. Which am I? (variant 484)",
  "I’m green at night and invisible in daylight. Which am I? (variant 485)",
  "I’m yellow at night and invisible in daylight. Which am I? (variant 486)",
  "I’m black at night and invisible in daylight. Which am I? (variant 487)",
  "I’m white at night and invisible in daylight. Which am I? (variant 488)",
  "I’m purple at night and invisible in daylight. Which am I? (variant 489)",
  "I’m orange at night and invisible in daylight. Which am I? (variant 490)",
  "I can be in a box but I’m not physical. The more you share me, the less you have. Which am I? (variant 491)",
  "I can be in a room but I’m not physical. The more you share me, the less you have. Which am I? (variant 492)",
  "I can be in a bottle but I’m not physical. The more you share me, the less you have. Which am I? (variant 493)",
  "I can be in a bag but I’m not physical. The more you share me, the less you have. Which am I? (variant 494)",
  "I can be in a house but I’m not physical. The more you share me, the less you have. Which am I? (variant 495)",
  "I can be in a train but I’m not physical. The more you share me, the less you have. Which am I? (variant 496)",
  "I can be in a road but I’m not physical. The more you share me, the less you have. Which am I? (variant 497)",
  "I can be in a river but I’m not physical. The more you share me, the less you have. Which am I? (variant 498)",
  "I can be in a clock but I’m not physical. The more you share me, the less you have. Which am I? (variant 499)",
  "I can be in a mirror but I’m not physical. The more you share me, the less you have. Which am I? (variant 500)"
]
